# YOLOv9 modified

# parameters
nc: 12  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
# activation: nn.LeakyReLU(0.1)
# activation: nn.ReLU()

# anchors
anchors: 3

# backbone
backbone:
  [
   [-1, 1, Silence, []],  # 0
   
   # conv down
   [-1, 1, Conv, [64, 3, 2]],  # 1

   # conv down
   [-1, 1, Conv, [128, 3, 2]],  # 2

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  # 3

   # avg-conv down
   [-1, 1, ADown, [256]],  # 4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],  # 5

   # avg-conv down
   [-1, 1, ADown, [512]],  # 6

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 7

   # avg-conv down
   [-1, 1, ADown, [512]],  # 8

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 9
  ]

# head and auxiliary
head:
  [
   
   [-1, 1, SPPELAN, [512, 256]],  # 10

   
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 11
   [[-1, 7], 1, Concat, [1]],  # 12

   
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 13

   
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 14
   [[-1, 5], 1, Concat, [1]],  # 15

   
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  # 16


   [-1, 1, ADown, [256]], # 17
   [[-1, 13], 1, Concat, [1]],  # 18


   [-1, 1, RepNCSP,[768, 768]], # 19


   [-1, 1, ADown, [512]], # 20
   [[-1, 10], 1, Concat, [1]],  # 21

   
   [-1,1, Conv, [256, 3, 1]], # 22
   
   # auxiliary branch
   
   # routing
   [5, 1, CBLinear, [[256]]], # 23
   [7, 1, CBLinear, [[256, 512]]], # 24
   [9, 1, CBLinear, [[256, 512, 512]]], # 25
   

   [[23, 24, 25, 4], 1, CBFuse, [[0, 0, 0]]], # 26  


   [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],  # 27


   [-1, 1, ADown, [512]],  # 28
   [[24, 25, -1], 1, CBFuse, [[1, 1]]], # 29


   [-1, 1, Conv, [512, 3, 1]], # 30


   [[27, 30, 16, 19, 22], 1, DualDDetect, [nc]],  # DualDDetect(A3, A4, A5, P3, P4, P5)
  ]
