# YOLOv9 modified

# parameters
nc: 12  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
activation: nn.LeakyReLU(0.1)
# activation: nn.ReLU()

# anchors
anchors: 3

# backbone
backbone:
  [
    [-1, 1, Silence, []],  # 0 640x640x3

    # left branch
    [0, 1, Conv, [64, 3, 2]], # 1 320x320x64

    [-1, 1, nn.AvgPool2d, [3, 2, 0, True]], # 2 160x160x64

    [-1, 1, Conv, [256, 3, 2]], # 3 80x80x256

    [-1, 1, nn.AvgPool2d, [3, 2, 0, True]], # 4 40x40x256

    [-1, 1, Conv, [512, 3, 1]], # 5 40x40x512

    [-1, 1, nn.AvgPool2d, [3, 2, 0, True]], # 6 20x20x512

    # right branch
    [0, 1, Conv, [128, 7, 4]], # 7 160x160x128

    [-1, 1, nn.MaxPool2d, [3, 2, 0, 1, False, True]], # 8 80x80x256

    [-1, 1, Conv, [256, 3, 1]], # 9 80x80x256

    [-1, 1, nn.MaxPool2d, [3, 2, 0, 1, False, True]], # 10 40x40x256

    [-1, 1, Conv, [512, 3, 1]], # 11 40x40x512

    [-1, 1, nn.MaxPool2d, [3, 2, 0, 1, False, True]] # 12 20x20x512
  ]

# head
head:
  [
    [[6, 12], 1, Concat, [1]], # 13 20x20x1024

    [-1, 1, SPPELAN, [1024, 512]], # 14 20x20x1024

    [-1, 1,  nn.Upsample, [None, 2, 'bilinear']], # 15 40x40x1024

    [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 16 40x40x512

    [-1, 1,  nn.Upsample, [None, 2, 'bilinear']], # 17 80x80x512

    [[-1, 3, 9], 1, Concat, [1]], # 18 80x80x1024

    [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]], # 19 80x80x512

    [[19], 1, Detect, [nc]] # 21
  ]
